#+TITLE: Term frequency: Monolithic style
#+TODO: TODO | DONE CANCELED
#+content: showeverything

- Count how many times each one of the words appear in the document
- Display the 25 keywords with the most repetitions
- Display it in reverse

1. Remove the punctuations signs =.';\-"\_=
2. Remove the empty spaces
3. Accumulate each one of the words in a hash
4. Sort by key
5. Reverse the list
6. Flush to stdout
  
***** 1st version
     CLOCK: [2014-10-06  14:26]--[2014-10-06  14:49] =>  0:23
     CLOCK: [2014-10-06  14:26]--[2014-10-06  14:26] =>  0:00

#+BEGIN_SRC ruby :results output
  @words = Hash.new {|h,k| h[k] = 0 }
  
  File.read("pride-and-prejudice.txt").each_line do |line|
   line.gsub!(/[,.';\-"\_]/, " ")
    words = line.split(" ")
    words.each do |w|
      @words[w.downcase] += 1
    end
  end
  
  @words.sort {|a,b| a[1] <=> b[1]}.reverse.each do |k, v|
    puts "|#{k} | #{v} |"
  end
#+END_SRC

***** 2nd version: Removing the stop words
      CLOCK: [2014-10-06  14:58]--[2014-10-06  15:07] =>  0:09

#+BEGIN_SRC ruby :results output
  @stop_words = File.read('stop_words.txt').split(',')
  @words = Hash.new {|h,k| h[k] = 0 }
  
  File.read("pride-and-prejudice.txt").each_line do |line|
   line.gsub!(/[,.';\-"\_]/, " ")
    words = line.split(" ")
    words.each do |w|
      next if @stop_words.include?(w)
      @words[w.downcase] += 1
    end
  end
  
  @words.sort {|a,b| a[1] <=> b[1]}.reverse.each do |k, v|
    puts "|#{k} | #{v} |"
  end
#+END_SRC

